# -------------------------------------------------------------------------------------------------------------------------
# 정수 n이 주어졌을 때, 00시00분00초 부터 n시 59분 59초까지의 모든 시각 중에 3이 하나라도 포함되는 모든 경우의 수를 구하는 프로그램
# -------------------------------------------------------------------------------------------------------------------------

print("시각h를 입력하세요: ")
h = int(input())

count = 0

for i in range(h + 1):
    for j in range(60):
        for k in range(60):
            if '3' in str(i) + str(j) + str(k):
                count += 1

print(count)